{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "FacebookAI/roberta-large",
  "bias": "all",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.2,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value_proj",
    "query",
    "key_proj",
    "query_proj",
    "key",
    "value"
  ],
  "task_type": "TOKEN_CLS",
  "use_rslora": true
}